{"cursor":"2482","size":15,"audio":[],"currentlang":"en","article":"In mathematics, a 'rigid' collection C of mathematical objects (for instance\nsets or functions) is one in which every c â C is uniquely determined\nby less information about c than one would expect.\n\nThe above statement does not define a mathematical property. Instead, it\ndescribes in what sense the adjective rigid is typically used in mathematics, by\nmathematicians.\n\nSome examples include: #Harmonic functions on the unit disk are rigid in the\nsense that they are uniquely determined by their boundary values. #Holomorphic\nfunctions are determined by the set of all derivatives at a single point. A\nsmooth function from the real line to the complex plane is not, in general,\ndetermined by all its derivatives at a single point, but it is if we require\nadditionally that it be possible to extend the function to one on a\nneighbourhood of the real line in the complex plane. The Schwarz lemma is an\nexample of such a rigidity theorem. #By the fundamental theorem of algebra,\npolynomials in 'C' are rigid in the sense that any polynomial is completely\ndetermined by its values on any infinite set, say 'N', or the unit disk. Note\nthat by the previous example, a polynomial is also determined within the set of\nholomorphic functions by the finite set of its non-zero derivatives at any\nsingle point. #Linear maps 'L'(X, Y) between vector spaces X, Y are\nrigid in the sense that any 'L' â 'L'(X, Y) is completely determined by\nits values on any set of basis vectors of X. #Mostow's rigidity theorem, which\nstates that negatively curved manifolds are isomorphic if some rather weak\nconditions on them hold. #A well-ordered set is rigid in the sense that the\nonly (order-preserving) automorphism on it is the identity function.\nConsequently, an isomorphism between two given well-ordered sets will be\nunique. #Cauchy's theorem on geometry of convex polytopes states that a convex\npolytope is uniquely determined by the geometry of its faces and combinatorial\nadjacency rules.\n","linknr":91,"url":"Rigidity_(mathematics)","recorded":1362892912,"links":11,"instances":["geometry","statistics"],"pdf":[],"categories":["Mathematical terminology"],"headings":["See also"],"image":["//bits.wikimedia.org/static-1.21wmf10/skins/vector/images/search-ltr.png?303-4","//bits.wikimedia.org/images/wikimedia-button.png","//bits.wikimedia.org/static-1.21wmf10/skins/common/images/poweredby_mediawiki_88x31.png"],"tags":[["cauchy's_theorem","geometry"],["degrees_of_freedom","statistics"]],"members":["degrees_of_freedom"],"related":["Mathematics","∈","Harmonic_function","Holomorphic_functions","Schwarz_lemma","Fundamental_theorem_of_algebra","Polynomial","Infinite_set","Unit_disk","Basis_vector","Mostow's_rigidity_theorem","Well-ordered_set","Order-preserving","Automorphism","Isomorphism","Cauchy's_theorem_(geometry)","Convex_polytope","Structural_rigidity","Degrees_of_freedom_(statistics)"]}